## Plan Result (sbox-global)




<pre><code>Plan: 0 to add, 5 to change, 0 to destroy.</code></pre>

* Update
  * module.landing_zone.azurerm_frontdoor.main
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;hmcts-access&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;idam-user-dashboard&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;idam-web-public&#34;]
  * module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.landing_zone.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id          = (known after apply)
      + logs        = (known after apply)
      + metrics     = (known after apply)
      + resource_id = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor.main will be updated in-place
  ~ resource "azurerm_frontdoor" "main" {
        id                                           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox"
        name                                         = "hmcts-sbox"
      ~ tags                                         = {
          ~ "environment"  = "Sandbox" -> "sandbox"
            # (4 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)

      ~ routing_rule {
          ~ frontend_endpoints = [
              - "idam-web-public",
              + "hmi-apim",
            ]
            id                 = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/routingRules/idam-web-public"
          ~ name               = "idam-web-public" -> "hmi-apim"
            # (3 unchanged attributes hidden)

          ~ forwarding_configuration {
              ~ backend_pool_name                     = "idam-web-public" -> "hmi-apim"
                # (5 unchanged attributes hidden)
            }
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "hmcts-access",
              + "cft-api-mgmt",
            ]
            id                 = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/routingRules/hmcts-access"
          ~ name               = "hmcts-access" -> "cft-api-mgmt"
            # (3 unchanged attributes hidden)

          ~ forwarding_configuration {
              ~ backend_pool_name                     = "hmcts-access" -> "cft-api-mgmt"
                # (5 unchanged attributes hidden)
            }
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "idam-web-admin",
              + "reformscan",
            ]
            id                 = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/routingRules/idam-web-admin"
          ~ name               = "idam-web-admin" -> "reformscan"
            # (3 unchanged attributes hidden)

          ~ forwarding_configuration {
              ~ backend_pool_name                     = "idam-web-admin" -> "reformscan"
                # (5 unchanged attributes hidden)
            }
        }
      ~ routing_rule {
          ~ accepted_protocols = [
              - "Https",
              + "Http",
            ]
          ~ frontend_endpoints = [
              - "idam-user-dashboard",
              + "idam-web-public",
            ]
            id                 = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/routingRules/idam-user-dashboard"
          ~ name               = "idam-user-dashboard" -> "idam-web-publicHttpsRedirect"
            # (2 unchanged attributes hidden)

          - forwarding_configuration {
              - backend_pool_name                     = "idam-user-dashboard" -> null
              - cache_enabled                         = true -> null
              - cache_query_parameter_strip_directive = "StripNone" -> null
              - cache_query_parameters                = [] -> null
              - cache_use_dynamic_compression         = false -> null
              - forwarding_protocol                   = "HttpOnly" -> null
            }

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      ~ routing_rule {
          ~ accepted_protocols = [
              - "Https",
              + "Http",
            ]
          ~ frontend_endpoints = [
              - "plum",
              + "hmcts-access",
            ]
            id                 = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/routingRules/plum"
          ~ name               = "plum" -> "hmcts-accessHttpsRedirect"
            # (2 unchanged attributes hidden)

          - forwarding_configuration {
              - backend_pool_name                     = "plum" -> null
              - cache_enabled                         = true -> null
              - cache_query_parameter_strip_directive = "StripNone" -> null
              - cache_query_parameters                = [] -> null
              - cache_use_dynamic_compression         = false -> null
              - forwarding_protocol                   = "HttpOnly" -> null
            }

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      ~ routing_rule {
          ~ accepted_protocols = [
              - "Https",
              + "Http",
            ]
          ~ frontend_endpoints = [
              - "hmi-apim",
              + "idam-web-admin",
            ]
            id                 = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/routingRules/hmi-apim"
          ~ name               = "hmi-apim" -> "idam-web-adminHttpsRedirect"
            # (2 unchanged attributes hidden)

          - forwarding_configuration {
              - backend_pool_name                     = "hmi-apim" -> null
              - cache_enabled                         = false -> null
              - cache_query_parameter_strip_directive = "StripNone" -> null
              - cache_query_parameters                = [] -> null
              - cache_use_dynamic_compression         = false -> null
              - forwarding_protocol                   = "HttpOnly" -> null
            }

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      ~ routing_rule {
          ~ accepted_protocols = [
              - "Https",
              + "Http",
            ]
          ~ frontend_endpoints = [
              - "cft-api-mgmt",
              + "idam-user-dashboard",
            ]
            id                 = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/routingRules/cft-api-mgmt"
          ~ name               = "cft-api-mgmt" -> "idam-user-dashboardHttpsRedirect"
            # (2 unchanged attributes hidden)

          - forwarding_configuration {
              - backend_pool_name                     = "cft-api-mgmt" -> null
              - cache_enabled                         = false -> null
              - cache_query_parameter_strip_directive = "StripNone" -> null
              - cache_query_parameters                = [] -> null
              - cache_use_dynamic_compression         = false -> null
              - forwarding_protocol                   = "HttpOnly" -> null
            }

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      ~ routing_rule {
          ~ accepted_protocols = [
              - "Https",
              + "Http",
            ]
          ~ frontend_endpoints = [
              - "reformscan",
              + "plum",
            ]
            id                 = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/routingRules/reformscan"
          ~ name               = "reformscan" -> "plumHttpsRedirect"
            # (2 unchanged attributes hidden)

          - forwarding_configuration {
              - backend_pool_name                     = "reformscan" -> null
              - cache_enabled                         = false -> null
              - cache_query_parameter_strip_directive = "StripNone" -> null
              - cache_query_parameters                = [] -> null
              - cache_use_dynamic_compression         = false -> null
              - forwarding_protocol                   = "HttpOnly" -> null
            }

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      ~ routing_rule {
          ~ accepted_protocols = [
              - "Https",
              + "Http",
            ]
          ~ frontend_endpoints = [
              - "labs-louisehuyton-walkthrough",
              + "hmi-apim",
            ]
            id                 = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/routingRules/labs-louisehuyton-walkthrough"
          ~ name               = "labs-louisehuyton-walkthrough" -> "hmi-apimHttpsRedirect"
            # (2 unchanged attributes hidden)

          - forwarding_configuration {
              - backend_pool_name                     = "labs-louisehuyton-walkthrough" -> null
              - cache_enabled                         = true -> null
              - cache_query_parameter_strip_directive = "StripNone" -> null
              - cache_query_parameters                = [] -> null
              - cache_use_dynamic_compression         = false -> null
              - forwarding_protocol                   = "HttpOnly" -> null
            }

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      ~ routing_rule {
          ~ accepted_protocols = [
              - "Https",
              + "Http",
            ]
          ~ frontend_endpoints = [
              - "labs-zcwalkthrough-nodejs",
              + "cft-api-mgmt",
            ]
            id                 = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/routingRules/labs-zcwalkthrough-nodejs"
          ~ name               = "labs-zcwalkthrough-nodejs" -> "cft-api-mgmtHttpsRedirect"
            # (2 unchanged attributes hidden)

          - forwarding_configuration {
              - backend_pool_name                     = "labs-zcwalkthrough-nodejs" -> null
              - cache_enabled                         = true -> null
              - cache_query_parameter_strip_directive = "StripNone" -> null
              - cache_query_parameters                = [] -> null
              - cache_use_dynamic_compression         = false -> null
              - forwarding_protocol                   = "HttpOnly" -> null
            }

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "idam-web-public",
              + "reformscan",
            ]
            id                 = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/routingRules/idam-web-publicHttpsRedirect"
          ~ name               = "idam-web-publicHttpsRedirect" -> "reformscanHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "hmcts-access",
              + "labs-louisehuyton-walkthrough",
            ]
            id                 = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/routingRules/hmcts-accessHttpsRedirect"
          ~ name               = "hmcts-accessHttpsRedirect" -> "labs-louisehuyton-walkthroughHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "idam-web-admin",
              + "labs-zcwalkthrough-nodejs",
            ]
            id                 = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/routingRules/idam-web-adminHttpsRedirect"
          ~ name               = "idam-web-adminHttpsRedirect" -> "labs-zcwalkthrough-nodejsHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      - routing_rule {
          - accepted_protocols = [
              - "Http",
            ] -> null
          - enabled            = true -> null
          - frontend_endpoints = [
              - "idam-user-dashboard",
            ] -> null
          - id                 = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/routingRules/idam-user-dashboardHttpsRedirect" -> null
          - name               = "idam-user-dashboardHttpsRedirect" -> null
          - patterns_to_match  = [
              - "/*",
            ] -> null

          - redirect_configuration {
              - redirect_protocol = "HttpsOnly" -> null
              - redirect_type     = "Moved" -> null
            }
        }
      - routing_rule {
          - accepted_protocols = [
              - "Http",
            ] -> null
          - enabled            = true -> null
          - frontend_endpoints = [
              - "plum",
            ] -> null
          - id                 = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/routingRules/plumHttpsRedirect" -> null
          - name               = "plumHttpsRedirect" -> null
          - patterns_to_match  = [
              - "/*",
            ] -> null

          - redirect_configuration {
              - redirect_protocol = "HttpsOnly" -> null
              - redirect_type     = "Moved" -> null
            }
        }
      - routing_rule {
          - accepted_protocols = [
              - "Http",
            ] -> null
          - enabled            = true -> null
          - frontend_endpoints = [
              - "hmi-apim",
            ] -> null
          - id                 = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/routingRules/hmi-apimHttpsRedirect" -> null
          - name               = "hmi-apimHttpsRedirect" -> null
          - patterns_to_match  = [
              - "/*",
            ] -> null

          - redirect_configuration {
              - redirect_protocol = "HttpsOnly" -> null
              - redirect_type     = "Moved" -> null
            }
        }
      - routing_rule {
          - accepted_protocols = [
              - "Http",
            ] -> null
          - enabled            = true -> null
          - frontend_endpoints = [
              - "cft-api-mgmt",
            ] -> null
          - id                 = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/routingRules/cft-api-mgmtHttpsRedirect" -> null
          - name               = "cft-api-mgmtHttpsRedirect" -> null
          - patterns_to_match  = [
              - "/*",
            ] -> null

          - redirect_configuration {
              - redirect_protocol = "HttpsOnly" -> null
              - redirect_type     = "Moved" -> null
            }
        }
      - routing_rule {
          - accepted_protocols = [
              - "Http",
            ] -> null
          - enabled            = true -> null
          - frontend_endpoints = [
              - "reformscan",
            ] -> null
          - id                 = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/routingRules/reformscanHttpsRedirect" -> null
          - name               = "reformscanHttpsRedirect" -> null
          - patterns_to_match  = [
              - "/*",
            ] -> null

          - redirect_configuration {
              - redirect_protocol = "HttpsOnly" -> null
              - redirect_type     = "Moved" -> null
            }
        }
      - routing_rule {
          - accepted_protocols = [
              - "Http",
            ] -> null
          - enabled            = true -> null
          - frontend_endpoints = [
              - "labs-louisehuyton-walkthrough",
            ] -> null
          - id                 = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/routingRules/labs-louisehuyton-walkthroughHttpsRedirect" -> null
          - name               = "labs-louisehuyton-walkthroughHttpsRedirect" -> null
          - patterns_to_match  = [
              - "/*",
            ] -> null

          - redirect_configuration {
              - redirect_protocol = "HttpsOnly" -> null
              - redirect_type     = "Moved" -> null
            }
        }
      - routing_rule {
          - accepted_protocols = [
              - "Http",
            ] -> null
          - enabled            = true -> null
          - frontend_endpoints = [
              - "labs-zcwalkthrough-nodejs",
            ] -> null
          - id                 = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/routingRules/labs-zcwalkthrough-nodejsHttpsRedirect" -> null
          - name               = "labs-zcwalkthrough-nodejsHttpsRedirect" -> null
          - patterns_to_match  = [
              - "/*",
            ] -> null

          - redirect_configuration {
              - redirect_protocol = "HttpsOnly" -> null
              - redirect_type     = "Moved" -> null
            }
        }

        # (46 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["hmcts-access"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/hmctsaccesssbox"
        name                              = "hmctsaccesssbox"
      ~ tags                              = {
          ~ "environment"  = "Sandbox" -> "sandbox"
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["idam-user-dashboard"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/idamuserdashboardsbox"
        name                              = "idamuserdashboardsbox"
      ~ tags                              = {
          ~ "environment"  = "Sandbox" -> "sandbox"
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["idam-web-public"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/idamwebpublicsbox"
        name                              = "idamwebpublicsbox"
      ~ tags                              = {
          ~ "environment"  = "Sandbox" -> "sandbox"
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "frontdoor_diagnostics" {
        id                         = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox|fd-log-analytics"
        name                       = "fd-log-analytics"
        # (2 unchanged attributes hidden)

      - log {
          - category = "FrontdoorAccessLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      - log {
          - category = "FrontdoorWebApplicationFirewallLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

Plan: 0 to add, 5 to change, 0 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["hmcts-access"] has changed
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
      ~ frontend_endpoint_ids             = [
          + "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourcegroups/lz-sbox-rg/providers/Microsoft.Network/frontdoors/hmcts-sbox/frontendendpoints/hmcts-access",
        ]
        id                                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/hmctsaccesssbox"
        name                              = "hmctsaccesssbox"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Low"
            "environment"  = "Sandbox"
        }
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":1359,"Program":"tfcmt","SHA1":"","Target":"sbox-global","Vars":{}} -->